#include <gtk/gtk.h>
#include <glib/gprintf.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <time.h>
#include <glib.h>
#include <pthread.h>
#include <string.h>
#include <gdk/gdk.h>
#include <sys/socket.h>
#include <arpa/inet.h>
#include <netinet/in.h>
#include <sys/types.h>
#include <sys/ioctl.h>
#include <net/if.h>
#include <sys/reboot.h>
#include <termios.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <signal.h>
#include <sys/time.h>       /* for struct timeval {} */
#include <stdint.h>
#include <semaphore.h>
#include <sys/mman.h>
#include <ifaddrs.h> 
#include <linux/rtnetlink.h>
#include <errno.h>

#define ROLLER_UP    0x10
#define ROLLER_DWN   0x20 
#define ROLLER_HALT  0x00

char Hardware_Version[] = "1.0";  
char Firmware_Version[] = "1.0";

char Device[2][25]={
	{"Twin Rubber"},
    {"Steel Rubber"}
};

char u8AlarmStr[7][25]={
	{"No Alarm"},
	{"Roller Up Temp High"},
	{"Roller Down Temp High"},
	{"IR Sensor Error-UP"},
	{"IR Sensor Error-Down"},
	{"KTC Sensor Error-Up"},
	{"KTC Sensor Error-Down"}
};

// enum
// {
// NO_ALARM = 0x00,
// ROLLER_UP_TEMP_HIGH,
// ROLLER_DOWN_TEMP_HIGH,
// AMBIENT_UP_TEMP_HIGH,
// AMBIENT_DOWN_TEMP_HIGH,
// IR_SENSOR_UP_ERROR,
// IR_SENSOR_DOWN_ERROR,   
// KTC_SENSOR_UP_ERROR,//K type Thermocouple means KTC
// KTC_SENSOR_DOWN_ERROR,
// }SYSTEM_ALARMS;

void *Data_Background_thread()
{
	
}

int PlusState = 0;
int MinusState = 0;

int TempPlusState1 = 0;
int TempMinusState1 = 0;
int CtrlOffsetPlusState1 = 0;
int CtrlOffsetMinusState1 = 0;
int CtrlOutputPlusState1 = 0;
int CtrlOutputMinusState1 = 0;
int TempOffsetPlusState1 = 0;
int TempOffsetMinusState1 = 0;

int TempPlusState2 = 0;
int TempMinusState2 = 0;
int CtrlOffsetPlusState2 = 0;
int CtrlOffsetMinusState2 = 0;
int CtrlOutputPlusState2 = 0;
int CtrlOutputMinusState2 = 0;
int TempOffsetPlusState2 = 0;
int TempOffsetMinusState2 = 0;

int SettingState = 0;

int16_t Heater1 = 0;
int16_t Heater2 = 0;
int16_t Laser = 0;
int16_t LaserStatus = 0;
int16_t MotorState = 0;

int16_t Current_Up_Temperature;
int16_t Current_Down_Temperature;

int16_t Set_Temp_Value1 = 30; 
int16_t Set_Temp_Value2 = 30;
int16_t Temperature1 = 30;
int16_t Temperature2 = 30;

int16_t Speed = 10; 
int16_t MotorDirection = 1;		// 1 - Forward  0 - Backward
int16_t RollerDirection = ROLLER_HALT;
gboolean RollerDownState, RollerUpState;

int16_t Set_CtrlOffset_Value1 = 0;
int16_t Set_CtrlOffset_Value2 = 20;
int16_t ControlOffset1 = 0;
int16_t ControlOffset2 = 20;

int16_t Set_CtrlOutput_Value1 = 10;
int16_t Set_CtrlOutput_Value2 = 100;
int16_t ControlOutput1 = 10;
int16_t ControlOutput2 = 100;

int16_t Set_TempOffset_Value1 = -25;
int16_t Set_TempOffset_Value2 = 25;
int16_t TemperatureOffset1 = -25;
int16_t TemperatureOffset2 = 25;

int16_t SystemWarning=1;

int16_t AmbientTemperature1 = 25;
int16_t AmbientTemperature2 = 25;

int16_t DeviceType=1;

int NumState1=0;
int NumState2=0;
int NumState3=0;
int NumState4=0;
int NumState5=0;
int NumState6=0;
int NumState7=0;
int NumState8=0;
int NumState9=0;
int NumState0=0;

char password_in[4];
int passwordlen=0;

typedef struct MODBUS_REGISTERS{
    int16_t Set_Up_Temperature;			//1
    int16_t Set_Down_Temperature;		//2
    int16_t Motor_Speed_Percentage;		//3
    int16_t Heater_ON_OFF_Up_Sensor;	//4
    int16_t Heater_ON_OFF_Down_Sensor;	//5
    int16_t Rod_Up_Down;				//6
    int16_t Motor_Direction_Control;	//7
    int16_t Motor_Start_Stop;			//8
    int16_t Sensor_OffSet_1;			//9 ---Reading Calibration + - Offset point of Roller_1 Down side 
    int16_t Sensor_OffSet_2;			//10---Reading Calibration + - Offset point of Roller_2 Up side 
    int16_t Control_OffSet_1;			//11 0-200 ie 0-20 degree Celcius it is pre braking point from where the
    int16_t Control_OffSet_2;			//12 heat reduces to a certain percentage.
    int16_t Control_Output_Up_Sensor;	//13 This value is in percentage
    int16_t Control_Output_Down_Sensor;	//14  10% to 100%
    int16_t Laser_Control_Reg;			//15
    int16_t Rod_Rotation_Pulses_Reset;	//16----Area Reset in Old Document
    int16_t Current_Up_Temperature;		//17
    int16_t Ambient_Up_Temperature;		//18
    int16_t Current_Down_Temperature;	//19
    int16_t Ambient_Down_Temperature;	//20
    int16_t Rod_Rotation_Pulses;		//21
    int16_t Emergency_Switch_Input;		//22
    int16_t NTC_Sensor_1_Status;		//23
    int16_t NTC_Sensor_2_Status;		//24
    int16_t System_Alarm;				//25
}MODBUS_REGISTERS;

MODBUS_REGISTERS STDregisters;

typedef struct
{
	GtkWidget *TimeLabel1, *DateLabel1;
	GtkWidget *RollTemp1, *RollTemp2;
	GtkWidget *SetTempDisp1, *SetTempDisp2;
	GtkWidget *SpeedPlusDown, *SpeedPlusUp, *SpeedMinusDown, *SpeedMinusUp, *SettingButtonUp, *SettingButtonDown;
	GtkWidget *SpeedEntry;
	GtkWidget *SetCtrlOffsetDisp1, *SetCtrlOffsetDisp2;
	GtkWidget *SetCtrlOutputDisp1, *SetCtrlOutputDisp2;
	GtkWidget *SetTempOffsetDisp1, *SetTempOffsetDisp2;
	GtkWidget *TempMinusDown1, *TempMinusUp1, *TempPlusDown1, *TempPlusUp1, *TempEntry1;
	GtkWidget *TempMinusDown2, *TempMinusUp2, *TempPlusDown2, *TempPlusUp2, *TempEntry2;
	GtkWidget *HandSafetyOFF;
	
	GtkWidget *CtrlOffsetMinusDown1, *CtrlOffsetMinusUp1, *CtrlOffsetPlusDown1, *CtrlOffsetPlusUp1, *CtrlOffsetEntry1;
	GtkWidget *CtrlOffsetMinusDown2, *CtrlOffsetMinusUp2, *CtrlOffsetPlusDown2, *CtrlOffsetPlusUp2, *CtrlOffsetEntry2;
